/*
1. 说一下 ''== 0 和 ''===0的区别
2.function a() {
  b(a);
  var a=10;
  function b() {
      console.log(a);
  }
}//输出结果
3.正则实现正负小数的匹配
4.call和apply的区别
5.盒子垂直居中 2种方法实现
6.箭头函数和普通函数的区别
7.数组去重两种方式
8.你对vue/angular/react理解,vue优先(自己对vue的整体认识)
9.浏览器缓存机制,为什么第一次打开页面的速度慢,第二次打开的速度快
10.

*/

/*
第二部分
手写实现es5继承:
手写深度拷贝:多种实现
说一下你最近项目实现的一个模块和在项目中遇到的坑



技术面试问到的问题
1.简历上写的几乎是全部问到了(90%左右)

说一下你对jquery的理解(框架的整体设计,入口函数,jQuery的真实构造函数设计)
jquery和vue分别适用于那些场景
git的使用流程/常用命令/分布式和集中式版本控制的区别
Promise的理解/你在哪些场景使用过
闭包的使用场景:
        闭包常见的使用场景循环绑定事件/函数柯里化/偏函数......



2.项目部分
  项目是如何分工的
  你负责的模块
  项目中遇到的坑/错误如何处理
  有没有写文档的习惯
  有一个项目你如何快速的上手
  讲一下你使用vue实现了什么功能
  vue的生命周期钩子:[没回答上来]
谈谈你对组件化的理解
vue中的组件包含哪些内容

* */

